# 한줄 주석
'''
    여러줄 주석
    파이썬
     1) 특화
        빅데이터 프로그램 (라이브러리 = 데이터 통계,수집)
        웹 = 장고
        = 분석 : 넘파일, 판다스
        = 시각화 : MatplotLib, Seabon
        분석 : 데이터 수집 = 데이터 전처리 = 통계
              = 머신러닝 / 딥러닝 / 예측
        = 단점 : AI (기본 3년차, 석사)
     2) 특징
        자바/C => 컴파일 방법
        파이썬 => 인터프리터 => 속도가 빠르다
                 배우기가 쉽다
                 => 데이터형이 자동처리
                    ------ 모든 데이터형은 객체인식
                    <class, int>
     3) 들여쓰기
        for
          for
     4) 기본 문법
        1. 변수
        2. 연산자
        3. 제어문
        4. 함수
        5. 라이브러리
        6. 객체지향 프로그램 : this(X), _self
        7. 데이터베이스
        8. 웹 크롤링 (셀레니움)
        9. 넘파이
        10. 판다스 (통계,분석)
        11. 시각화
        12. 장고
'''
